{'1049519': 'who said no one can make you feel inferior', 'D3464': 'No one can make you feel inferior without your consent. No one can make you feel inferior without your consent. By philosiblog on 11 October 2012 in accomplishment, belief, confidence, focus, optimism, perspective No one can make you feel inferior without your consent. – Eleanor Roosevelt Do you care if it’s called a rose or anything else? Would a rose care if you called it a dandelion? So why do we give our consent to others to make us feel inferior? What does that mean? This quote reminds me of another famous couple of lines about the meaning of words. “ What’s in a name? That which we call a rose by any other name would smell as sweet ” from Romeo & Juliet, Act 2, Scene 2, Lines 47,48. The names that someone calls you have whatever scent you chose to give them, and the same goes for the opinions others may have of you. If you decide that word ‘smells’ bad, you may end up feeling bad. In doing so, you give the word, and therefore the person, your consent to make you feel inferior. You could just as easily decide the word smells nice, or at least neutral, denying the word, and therefore the person, your consent. It really is that easy. It feels funny inside because of your habits, but as you train yourself to behave in a different manner, it will become more natural. But the thing to remember is that you believe in yourself, and your value as a person. Others may have their opinions, but of your value you are certain. Why is believing in yourself important? If you believe in yourself, why should the opinion of someone else matter to you or your self-value? Yes, it’s nice to have the approval of certain people in your life, but if you don’t get it, you have to decide if you believe in yourself, or if they (and their opinion of you) is more important. Now I don’t want you to think that I feel that believing in yourself means you ignore anything unflattering that others say. It just means that if an idiot is talking, take the source into consideration when evaluating what they say. If someone you trust has some constructive criticism, it doesn’t mean you stop believing in yourself, but it might be time to reevaluate and perhaps tweak some aspect of yourself. Believe in your worth as a human being. Believe that you can do things, and use the evidence of the things you have done to bolster that belief. We might not be able to do everything right now, but given time and effort and some help, there is little we cannot accomplish, eventually. Really, you can do it, if you can believe in yourself. Where can I apply this in my life? Every story has two sides. Which will you believe about yourself? I’m not talking about hiring a PR firm to help you put a positive spin on things that didn’t work as well as you hoped. I’m talking about giving more weight to the important lessons you learned from the experience, and how you will use that insight the next time you try. One way of looking at the event leads to feeling inferior. The other helps you believe in yourself. Either way, the choice is yours and yours alone. While that might sound a little bit silly, there really isn’t anyone else who can decide that for you, unless you give your consent to them. What are some of the things you do, and do well? What are the things you do which usually come out alright, and from which learn when things don’t work out quite as well as hoped? What are some of the skills, talents, and abilities you have that set you apart from the crowd? Are you feeling a little better about yourself? If someone came in right now and told you were somehow less of a person because you couldn’t do something they could, would you believe them, or would you be able to refuse to give your consent to them? Would you be able to let them know you’re happy for them and their ability, skill, or whatever, but it really wasn’t something you were all that interested in? You don’t have to brag about what you can do, but you don’t have to feel inferior because you can’t match the braggart at his best skill. Any time you’re feeling down, you’re probably focusing on the wrong side of the ledger. You’re focused on the things that have not gone the way you wanted, things that didn’t turn out, people who upset you, or things like that. Now you’re giving your consent to yourself to make you feel inferior. Personally, I try to avoid that whenever possible. If I catch myself acting that way, I try to shake off the gloomy mood, and start focusing on the things that have gone well, or at least on the lessons I have learned from the other events in my life. I try not to stay focused on the negative for any length of time, but try to guide my attention back to the things that are going well. Sometimes I have to really push it, and congratulate myself for eating breakfast without gagging on my spoon, or stabbing my tongue with the fork. But at least that was something positive, right? I try to make sure I never give myself my consent to make myself feel inferior. I try not to run myself down. And if I do, I try to pick myself back up and point myself in a positive direction, and get started again. Sometimes it takes a few tries, but I don’t give up. Do you? We all have evidence to found our belief in ourselves. We all have evidence to found a lack of belief in ourselves. Only you can make the decision as to which you will hold dear, and which you will ignore. The quote urges us to ignore those who would belittle us, and attempt to damage our belief in ourselves. From: Twitter, @Women Of History confirmed at : http://www.brainyquote.com/quotes/quotes/e/eleanorroo161321.html Photo by stephcarter Happy Birthday to Eleanor Roosevelt, born 11 October, 1884. Share this: Google Twitter Facebook Pinterest Email Print Reddit Tumblr Linked In Pocket Like this: Loading... About philosiblog I am a thinker, who is spending some time examining those short twitter quotes in greater detail on my blog. View all posts by philosiblog →Subscribe Subscribe to our e-mail newsletter to receive updates. Related Posts: Be here now. Be somewhere else later. Is that so complicated? Worry is a misuse of imagination. Do not take life too seriously. You will never get out of it alive. Fear is the cheapest room in the house. I’d like to see you in better living conditions. The quality of our actions, whether they are positive or negative, depends on our motivation. This is why we have to transform our minds. @Women Of History, consent, Eleanor Roosevelt, inferior, make'}
{'1049519': 'who said no one can make you feel inferior', 'D1710226': '. "Most early miscarriages (as many as 60% of first trimester ones) will remain unexplained. It is usually assumed these losses are genetic, where the chromosomes simply did not replicate correctly. Many people will assume that something that happened recently, such as an illness, fall, or exposure to something will have caused the miscarriage. This is rarely true, since by the time a miscarriage is diagnosed or begins, the baby has been lost for quite some time. Hopefully this section will help you understand the causes; you should also read the section on myths. There are several categories of miscarriage causes: Hormones Chromosome Defects Physical Problem with the Uterus or Cervix Immune Disorders Premature Rupture of Membranes and Early Labor Other Unknown Blighted Ovum, Ectopic Pregnancy, Molar Pregnancy, and Stillbirth There are a number of things that are not on the list above, even if you heard they cause miscarriage, because they are not documented causes of a loss. Here are two links to follow for those: [ myths about miscarriage ] [ undocumented causes ]Hormones When we talk about a hormone problem, you have likely miscarried in less than 10 weeks. After that, the placenta has taken over hormone production and any normal deficiency you have is not a factor. Low progesterone, the most common problem, is not as easy to treat as you might hope. Progesterone suppositories, while frequently prescribed, are not proven to be helpful and often actually cause a nonviable pregnancy to last longer than it should. The only situation where progesterone is a sure solution is with a luteal phase defect, where the corpus luteum, which is formed along with egg at ovulation, does not produce the hormones needed to sustain a pregnancy. For most women, however, this is usually not an every-month problem. Usually the situation rights itself with the next egg and the next corpus luteum. This problem, if it is a permanent one, can be diagnosed through two separate endometrial biopsies. Progesterone must be started 48 hours after ovulation to work. By the time you have missed a period, it is too late to save a pregnancy with a luteal phase defect. 5Low progesterone, however, is usually a symptom of an nonviable pregnancy, and not the cause. Doctors often prescribe progesterone suppositories out of patient pressure when the hormone levels are low, but their use is controversial and usually completely ineffective. A common treatment for a suspected progesterone problem is Clomid, a pill taken for five days early in your cycle to rev up your hormone production. Not everyone is a candidate for Clomid, and 25% of women will have decreased cervical mucus, which can actually make you less fertile. See the Sperm Meets Egg Plan for more information. Other hormone problems may be created when you have an untreated thyroid disorder. Your thyroid function can easily be tested, and this problem is very treatable. Chromosome Defects There are many factors that come in to play when the egg and sperm unite and form that first cell. Even if both the egg and sperm come with perfect chromosomes, the first few cell divisions can see an abnormality crop up that would certainly be devastating. Chromosome defects that cause a newly fertilized egg to die can account for as much as 60 percent of early miscarriages. You can usually find out if you had a baby with a chromosome problem through testing tissue from the miscarriage. This must be done RIGHT AWAY when the tissue comes out or the cells cannot grow and the test won't work. If this is your first miscarriage, however, do not go to great lengths to save tissue. Very few doctors will test it, and a chromosomal cause for the miscarriage will be assumed without testing. Even when you have a D&C and the doctor sends the tissue immediately, the test still might not work. (Mine didn't.) But if you do find your baby had a chromosome defect, find a small measure of comfort in knowing that although you lost this one precious baby, the chances of it happening again are extremely small. Another threshold will be crossed, however, at age 35. At that point, your eggs will begin to age, and your odds of a chromosomal miscarriage will begin increasing dramatically. After the 2 ndtrimester begins, the number of miscarriages caused by genetic factors drops to less than 10 percent. 3 If you have had several miscarriages in a row, then your odds of this being your problem are quite low, about 7%. 42Physical Problem with the Uterus or Cervix Some women have a uterus that does not have the usual shape. Others have a cervix that may be weakened by a number of causes, including multiple D&C procedures or their mother taking DES when she was pregnant (although note that DES was discontinued in 1971 and most DES daughters are leaving their childbirth years behind.) Both of these problems can cause early labor, usually during a critical period from 12-24 weeks. This cause is responsible for 12 percent of miscarriages during this time period. As the baby grows, especially during the very rapid growth spurt during this time frame, the irregularly shaped uterus may not be able to expand or the weak cervix may start to open up and let the baby out. There are treatments for both of these that are quite effective—corrective surgery on the uterus and a cervical stitch that holds the cervix closed. This problem WILL REOCCUR if not treated. A uterine abnormality often causes a miscarriage due to early labor, but it can also cause fetal demise, which is what happened to our Casey. Sixteen weeks into my pregnancy with Emily, we had an abnormal AFP screening. Since we were near the point of the pregnancy when Casey died, naturally we were frantic. We saw a perinatologist, who discovered I had a septate uterus. When I was a fetus, the two sections of tissue that normally fuse together to form the uterus only fused on the bottom. Therefore, there is a huge wall going down the middle of my uterus. When Casey implanted, he chose the middle wall. This section, however, has little blood flow. As Casey grew and required more and more blood and nutrition, this area could not support him. Although Emily chose a better implantation spot, this problem caused her to be breech and required a c-section. While I did have the surgery to correct this problem, my next pregnancy still had complications, and I was not allowed a vaginal delivery. Be aware that there are varying levels of septums. Some are paper-thin and simply move out of the way for the baby, causing no problems. Others, like mine, increase your chance of miscarriage significantly. Only a high-level sonogram or an HSG dye test can uncover this problem. Immune Disorders While many experienced and well respected reproductive endocrinologists specialize in this field now, many ""regular"" ob/gyn doctors are quite resistant to the idea of this type of miscarriage cause and its treatment. Specialists in immune disorders claim up to an 80% success rate with women who have had three or more miscarriages, but there is still much skepticism even among infertility and reproductive specialists. Antiphospholipid antibodies can cause blood clots in the placenta that block or slow down the baby's blood supply, causing growth to slow or the baby to die altogether. Your blood can be tested for these antibodies. These tests are called anticardiolipins or the associated lupus anticoagulant. These are inexpensive tests, and sometimes you can get them after only one miscarriage. If antibody levels are thought to be high enough to affect the pregnancy, treatment involves baby aspirin and sometimes a blood thinner called Heparin. In rare cases, the woman is actually found to have Lupus, which may be mild enough not to affect her, but needs management anyway to protect her pregnancies (see antinuclear antibodies). While a miscarriage due to this problem can happen at any time, often the baby will grow past the first trimester. 10 to 15% of recurring miscarriages are caused by these antibodies. 6Antinuclear antibodies are caused by an auto-immune problem, in Lupus or a Lupus-like syndrome, where the body attacks itself. The treatment for this problem is Prednisone, a corticosteroid, which calms down the inflammatory process of auto-immune disease. Prednisone, however, is really a horrible drug and will cause all sorts of terrible side effects, including swelling, bruise marks on the face, and discomfort. You do not ask for this drug without really needing it. 6Fetal-Blocking Antibodies work to protect the baby from the mother's immune system, which will recognize the father's genetic material as foreign to her body and attack it. When the sperm penetrate the egg, it provides foreign material, but it also contains histocompatibility locus antigens (HLA). The sperm's HLA will ""talk"" to the mother's HLA, which would normally attack the baby, and stimulate the mother's body to protect the baby. In some cases, however, the father's genetic material is too similar to the mother's. In that case, the mother's response is weak and insufficient to prevent her white blood cells from attacking the new cells. Standard testing for this is not yet available, and you would have be accepted into one of the few elite clinics working in this field. If your tests show you and your partner's DNA to be too similar, you can receive injections of your partner's white blood cells, in hopes of getting enough of his HLA in your system to stimulate a stronger protective response. This is an expensive and controversial tactic, but allegedly (a word I use since there isn't solid 3rd party data to support it) succeeds 80% of the time. 7, 42 This type of problem usually causes an early miscarriage, well before 12 weeks, and is often suspected when several miscarriages have occurred at the exact same time in the pregnancy The average OB/Gyn may not be up to date on these immune issues. Read up on it yourself and find a specialist who can determine if this is a problem that might be affecting your babies. You are not usually a candidate for the more involved testing, which is expensive and not typically covered by insurance, until you have at least three losses. Premature Rupture of Membranes and Early Labor Many miscarriages begin with cramping and labor-like symptoms, but true PROM and Early Labor are usually associated with babies that are in the second or third trimester. Early labor can often be treated with drugs that relax the uterus and women are placed on bed rest either at home or in the hospital. Sometimes, however, the baby comes anyway. This is one of the most traumatic of losses, technically a stillbirth and not a miscarriage after 20 weeks, because you will hold and see your baby and beg him or her to breathe. For some women, the baby will even be born alive, but only live for a few minutes, hours or days. There really is nothing harder in life than this. PROM is defined as your water breaking prior to 37 weeks, the age that is considered full term. Most women who have leaking or gushing amniotic fluid will be placed on antibiotics and placed in the hospital because the risk of infection is very high. Once an infection comes, the baby will almost always have to be delivered. Babies must weigh 500 grams, or about a pound, to survive. Because I was at high risk for PROM and early labor, I kept this day on my calendar and waited with fear for it to pass. For women expecting a normal pregnancy, suddenly having your water break is very frightening. Your are stuck in the hospital, having to rely on what people tell you, and unable to get information on your own. It is scary. PROM is thought largely to be caused by infections or inflammation of the uterus or fetal membranes. How these infections come or why they cause the membrane rupture is not completely understood. Pelvic exams and yeast infections are NOT considered to increase your risk for PROM. I do know, however, just in reality through talking with women, including a close friend of mine, that PROM tends to recur. Knowing you are at risk and taking all the appropriate precautions is essential to keeping your baby in the uterus as long as possible. Fortunately, even though PROM cannot always be treated or prevented, most babies are able to make it far enough to survive and lead normal lives. If you have experienced unexplained PROM, I highly recommend finding a doctor with experience with this sort of pregnancy. Others -- Infections, Age, Chronic Disease Many infections can cause miscarriage, but they are the big ones like syphilis, mycoplasma, toxoplasmosis, and malaria. An upper respiratory infection is NOT going to cause a miscarriage, even though it may worry you to death. Viruses are the same. Normal illnesses like the common cold will not cause a problem, but AIDS and German Measles can. Infections that directly affect the uterus are bigger risk. This does NOT include yeast infections, which are extremely common in pregnancy. See the section on Premature Rupture of Membranes for more information on these infections. There are a few common illnesses that can cause a miscarriage or fetal malformation if you get them for the FIRST TIME during pregnancy, including Chicken Pox and Fifth Disease. The vast majority of women already have immunity to these diseases, however, and should not be concerned about exposure to them during pregnancy. If you think you may not have immunity, ask your doctor to run an antibody titer to see if you have a live antibody, or only an old antibody to the disease in your blood. Only the live antibody without the old antibody present is a danger. An infection that causes a fever of over 101 degrees Fahrenheit should be treated immediately, however. There is a small risk that prolonged fever can affect your baby. Take Tylenol to keep your fever down and stay in touch with your doctor. Age is only a factor in miscarriage when you consider what aging can do to your body. The first and most common is with chromosomes. It is not YOU who have a problem, it is likely your egg or sperm, which have also aged. Age can, however, bring other problems such as poor health, disease, or hormonal imbalance that can make a pregnancy harder to sustain. You don't start seeing these problems in great numbers, however, until after 40. Health problems in the mother can create problems with the pregnancy. Diabetes, heart problems, and thyroid disorders are just a few that may complicate the pregnancy. Having these does NOT mean you will certainly have a miscarriage. You will simply have to be more careful and make sure your treatments are adapted if needed during pregnancy. Accidents typically do not cause a miscarriage. The baby is well protected in its amniotic sac, surrounded by fluid, and even a hard blow to the abdomen will likely only rock it. Most women who have a car accident, even with a certain amount of trauma, have their babies just fine. The Unknown The hardest thing to accept is no reason at all. You live in fear, wondering if the same terrible cause of your first baby's death will cause another one to die. You scarcely dare to try again. I have been in this situation and I tossed my doctor's statistics aside. I had already been on the wrong side of the statistics; I didn't care for anymore. But I do know this. One miscarriage hardly raises your chances to miscarry again at all. You are simply back at square one. Try to put the risk as far back in your mind as possible and enjoy another pregnancy. But I understand if you can't. Blighted Ovum, Ectopic Pregnancy, Molar Pregnancy, and Stillbirth Sometimes a pregnancy ends unhappily, but it is not technically a miscarriage. This section will touch on these types of situations. Blighted Ovum is a condition (with a terrible, unfortunate name) where the gestational sac grows, the woman gets all the pregnancy symptoms, but the baby itself never develops. The sac will continue to grow and grow, and most women do not know there is no baby until an ultrasound is done. The bleeding, if that happens before the blighted ovum is found via ultrasound, is slow and brown. Your pregnancy symptoms will seem to go away. A blighted ovum is believed to be caused by an egg or sperm with poor genetic material. When the egg is fertilized, instead of creating both a sac and a baby, the part that should be a baby never grows. A D&C is almost always needed to empty the uterus, because the body is very slow to realize there is no baby. Some women do experience more than one blighted ovum, but most women go on to later have a baby. An Ectopic Pregnancy is a normal fertilized egg that gets stuck in the fallopian tube (although occasionally it will fall into the abdominal cavity) and implants there. This type of pregnancy cannot survive and puts the mother at great risk for severe hemorrhaging and possibly even death as the baby grows and eventually bursts the tube. When the ectopic is discovered based on pain and symptoms rather than an early ultrasound, the mother will immediately have surgery to remove the baby. Things will happen very fast, and most likely if this has happened to you, you are reading this after it is all over. If you are afraid you have an ectopic, the symptoms that you really want to watch for are: sharp, intense pain in your abdomen or possibly in your shoulder; a pregnancy test that is positive, then turns negative a few days later; and spotty red bleeding that continues day after day. Ectopics that are caught early can be treated with a cancer drug called Methotrexate, which will end the pregnancy safely and without surgery. Ectopics are usually caused by scar tissue in the fallopian tubes that could have been caused by: previous surgery in the pelvic region, uterus, or tubes; a pelvic infection such as chlamydia or pelvic inflammatory disease; or endometriosis that blocks the entrance to the tubes. If you have had one ectopic, your risk increases for another one. See additional information on treatment . A Molar Pregnancy is a very rare type of pregnancy where an abnormal mass forms inside the uterus after the egg is fertilized. The baby usually does not form, but the uterus is filled with big bubble clusters. A molar pregnancy is caused when a sperm fertilizes an empty egg (called a complete molar pregnancy) and no baby grows, or when two sperm fertilize an egg and both the baby grows a little as well as an abnormal placenta (called a partial molar.) Even if a baby does grow, it cannot survive. The longest documented molar pregnancy I have seen was a 24-week stillbirth, and most molar pregnancies will be diagnosed and a D&C performed before the end of the first trimester. If a molar pregnancy has been diagnosed, your medical condition will be carefully monitored. In about 15% of molar pregnancies (usually complete molars and not partial), the moles spread to other parts of the body like cancer. A mild form of chemotherapy will have to be used (with methotrexate), but rest assured that the cure rate for this type of disease is very high. The signs of a molar pregnancy include: bleeding in the 12th week of pregnancy, a uterus that is larger than normal, and h CG levels that are too high. The molar pregnancy is removed by a dilating the cervix and gently suctioning out the clusters. Women who have had a molar pregnancy are usually advised not to get pregnant again for at least a year to ensure the cancerous form is not present. It is absolutely essential to follow doctors orders on when to try again with a molar pregnancy diagnosis. Do not cheat, and have regular follow ups even after your h CG is zero, to make sure it does not rise again. 8,9A stillbirth is technically any pregnancy that ends after the 20th week and the baby does not survive. Some babies die in utero and are discovered when the heartbeat is not found. The most common causes of this are: uterine abnormalities, a knot or other umbilical cord accident, infections of the lining of the gestational sac or cord, and placental abruptions that cause the placenta to pull away from the uterine wall. These babies are usually born through the induction of labor, although some babies are small enough to be taken by D&C or D&E procedures. Other babies are lost through early labor. The causes of early labor are Premature Rupture of Membranes , uterine abnormalities that make the uterus too small to hold the baby, and an incompetent cervix, which opens up and lets the baby out. Sometimes a stillbirth occurs during the birth, by an umbilical cord that gets pinched between the baby's head and the cervix, or the cord wraps around the baby's neck. Repeat stillbirths are extremely rare and are almost all related to uterine or cervix problems, which can be fixed or treated once found. "'}
{'1049519': 'who said no one can make you feel inferior', 'D2375850': 'Can a large ruptured disc heal itself? "07-03-2013, 09:52 PM # 1mizkt90Newbie (male)Join Date: Jul 2013Posts: 3Can a large ruptured disc heal itself? Just happened to stumble onto this site looking for some answers about what to expect the next few months with regard to my ailing back. After reading several threads, I decided to see if I could get some advice on what to do. So, I'll give a little background info: I'm 45 and have lived with back pain most of my adult life. About 15 years ago I was first diagnosed with degenerative disc disease. I had several physical therapy sessions before my left calf muscle became virtually useless. MRI at that time showed a bulge on S1-L5. My physiologist insisted that surgery was a last resort, so I took Naproxen for about 6 months until the pain finally subsided and eventually I regained function of my calf muscle. After that, I would have an occasional back blowout that a couple days rest and muscle relaxants would get me back on my feet. The pain was always in the muscles in the lower back. On 6-19, I felt my lower back give out with two distinct ""pops"" while attempting to lift something I had no business lifting. I had never experienced the kind of debilitating pain as what I felt that evening. So, after a miserable 120 mile drive home, it was Flexeril and hydrocodone for the night and next day. My back really did not feel horribly bad the next day and I thought that I was going to bounce back like before. During the night on 6-21, I woke at about 1:00 am with excruciating pain in my left thigh extending to the top of my knee. So, on Monday, 6-23, I went to see a spinal surgeon who performed a microdiscectomy on my 21 year old daughter the year before. He prescribed an MRI and the report is as follows: [I]The L1-L2 is negative At L2-L3 a large soft tissue density is present which appears to communicate with a left paracentral disc protrusion. The large soft tissue density extends from the left side of the L2-L3 disc space inferiorly along the left side of the L3 vertebral body. The soft tissue density has a superior to inferior diameter of 26 mm, an AP diameter of 9 mm, and a transverse diameter of 16 mm. The findings are consistent with a large extruded disc fragment. This is not believed to represent a mass, although no significant disc space narrowing is present at L2-L3 as would often be present with a large extruded disc fragment. At L3-L4, moderate disc desiccation, mild disc bulging. Small annular rent. Small central disc protrusion. At L4-L5 disc desiccation, right sided annular rent and mild to moderate disc bulging. Mild facet disease bilaterally foraminal narrowing. At L5-S1, moderate to severe osteoarthritis with disc space narrowing, disc desiccation and degenerative endplate changes. Mild facet disease bilaterally. Approximately 2 mm of retrolisthesis is present. A small to moderate left posterolateral disc osteophyte complex is present which results in mild displacement of the descending left S1 nerve root. [/I] So, I was scheduled for surgery on 7-9 for an L2-L3 discectomy followed by fusion of L2-L3. After I expressed some apprehension about having surgery so soon after the injury, the surgeon recommended waiting for a month to see how things progress. He said it all may heal itself?? After having some ups and downs, I now have about 70% strength loss in the left thigh, and at times pain that allows me about 3-4 hours sleep. I am now thinking I should have kept the 7-9 surgery date. I hate the way the meds make me feel and I refuse to risk meningitis for some pain relief. So, can a disc rupture heal on its own, or is surgery going to be necessary eventually? The surgeon said that I would not see any nerve damage for the first few months, but the way my left leg feels scares me. I would appreciate any personal experiences with ruptured discs healing on their own. I need some hope. mizkt Sponsors07-04-2013, 08:04 PM # 2teteri66Senior Veteran (female)Join Date: Nov 2010Location: USAPosts: 8,911Re: Can a large ruptured disc heal itself? Welcome to the board. To answer the question of your thread's title: in a word, yes. A large rupture can heal...but I'm sure it is dependent on a number of things. First let me say that we are not medical physicians...just fellow spine sufferers who share experiences. So take what I am about to say with that in mind. I may be way off base...but I would not proceed with surgery without getting at least one more opinion...and personally, I would get more than one ""second opinion."" It looks to me like fixing L2-L3 will be a temporary fix because there are issues at other levels that very well could cause problems and pain in the near future...and I imagine they may be causing you pain right now. The popping you felt after lifting was probably this disc rupturing. And this level shows signs of injury whereas the problems lower down are more the degenerative/arthritic type issues that get worse with time and more wear-and-tear. I'm not quite sure why he wanted to fuse L2-L3. The extruded matter probably needs to be moved off the spinal nerves at this point. The report indicates that the disc space has not narrowed...so I'm not sure why he would immediately do a fusion at this point. I'm curious if you are located in Canada or England? The language of the findings is different from your usual US radiology report. At the next two levels, L3-L4 and L4-L5 both discs have small bulges, included small annular tears...which can be painful. L5-S1 appears to have a number of degenerative issues. [B]At L5-S1, moderate to severe osteoarthritis with disc space narrowing, disc desiccation and degenerative endplate changes. Mild facet disease bilaterally. Approximately 2 mm of retrolisthesis is present. A small to moderate left posterolateral disc osteophyte complex is present which results in mild displacement of the descending left S1 nerve root. [/B] Here you have the moderate to severe arthritic changes that are causes the disc space to narrow and for the disc to dry out. The endplates (the area of bone that adjoins the discs) are showing degenerative changes as well. (These things all go hand-in-hand with DDD). The facets are also showing signs of degeneration, which causes them to enlarge and to form bone spurs. This ends up taking up space in the foramen which needs to be open for the nerves to pass out from the spine into the other areas of the body. These changes are causing the SI nerve on the left side to be slightly displaced. If this nerve displacement gets worse you may feel pain, tingling and/or numbness down the back of your thigh, wrapping around the calf and going down the foot to the little toe. These things may still be mild enough that they are not causing problems that you feel, but I imagine things will get worse in the future, as you age and there is that much more wear and tear on the spine...particularly if you keep lifting heavy items! (L4-L5 and L5-S1 are the two segments of the spine that take the brunt of any movement...they are the most abused, if you will....) I didn't understand your comment about risking meningitis. Oh, are you thinking of the contamination from that one compounding lab? You're referring to not wanting any ESIs?? I can tell you that it is possible to have a large ruptured disc heal. My husband had that experience almost 20 years ago...back in the olden days when doctors weren't so quick to operate...as I recall, it took about six months for him to feel relatively normal again. My best advice to you is to get at least one other opinion before proceeding with surgery...and please ask your surgeon about the issues at L5-S1. Good luck.07-05-2013, 12:28 AM # 3discogram Newbie (female)Join Date: Jul 2013Location: sydney australia Posts: 1Re: Can a large ruptured disc heal itself? [QUOTE=mizkt90;5195486]Just happened to stumble onto this site looking for some answers about what to expect the next few months with regard to my ailing back. After reading several threads, I decided to see if I could get some advice on what to do. So, I'll give a little background info: I'm 45 and have lived with back pain most of my adult life. About 15 years ago I was first diagnosed with degenerative disc disease. I had several physical therapy sessions before my left calf muscle became virtually useless. MRI at that time showed a bulge on S1-L5. My physiologist insisted that surgery was a last resort, so I took Naproxen for about 6 months until the pain finally subsided and eventually I regained function of my calf muscle. After that, I would have an occasional back blowout that a couple days rest and muscle relaxants would get me back on my feet. The pain was always in the muscles in the lower back. On 6-19, I felt my lower back give out with two distinct ""pops"" while attempting to lift something I had no business lifting. I had never experienced the kind of debilitating pain as what I felt that evening. So, after a miserable 120 mile drive home, it was Flexeril and hydrocodone for the night and next day. My back really did not feel horribly bad the next day and I thought that I was going to bounce back like before. During the night on 6-21, I woke at about 1:00 am with excruciating pain in my left thigh extending to the top of my knee. So, on Monday, 6-23, I went to see a spinal surgeon who performed a microdiscectomy on my 21 year old daughter the year before. He prescribed an MRI and the report is as follows: [I]The L1-L2 is negative At L2-L3 a large soft tissue density is present which appears to communicate with a left paracentral disc protrusion. The large soft tissue density extends from the left side of the L2-L3 disc space inferiorly along the left side of the L3 vertebral body. The soft tissue density has a superior to inferior diameter of 26 mm, an AP diameter of 9 mm, and a transverse diameter of 16 mm. The findings are consistent with a large extruded disc fragment. This is not believed to represent a mass, although no significant disc space narrowing is present at L2-L3 as would often be present with a large extruded disc fragment. At L3-L4, moderate disc desiccation, mild disc bulging. Small annular rent. Small central disc protrusion. At L4-L5 disc desiccation, right sided annular rent and mild to moderate disc bulging. Mild facet disease bilaterally foraminal narrowing. At L5-S1, moderate to severe osteoarthritis with disc space narrowing, disc desiccation and degenerative endplate changes. Mild facet disease bilaterally. Approximately 2 mm of retrolisthesis is present. A small to moderate left posterolateral disc osteophyte complex is present which results in mild displacement of the descending left S1 nerve root. [/I] So, I was scheduled for surgery on 7-9 for an L2-L3 discectomy followed by fusion of L2-L3. After I expressed some apprehension about having surgery so soon after the injury, the surgeon recommended waiting for a month to see how things progress. He said it all may heal itself?? After having some ups and downs, I now have about 70% strength loss in the left thigh, and at times pain that allows me about 3-4 hours sleep. I am now thinking I should have kept the 7-9 surgery date. I hate the way the meds make me feel and I refuse to risk meningitis for some pain relief. So, can a disc rupture heal on its own, or is surgery going to be necessary eventually? The surgeon said that I would not see any nerve damage for the first few months, but the way my left leg feels scares me. I would appreciate any personal experiences with ruptured discs healing on their own. I need some hope. mizkt [/QUOTE] hi there, i had suffered a spinal injury years ago and as a result ended up with ten damaged disc's in my spine, cervical disc's 4 thorasic disc's 3 lumber disc's 3. I was given the option of surgury and refused as once they fuse your disc's you are stuck with them for life. my friend has her L3,4 and 5 fused and 7 years down the track she spend at least one week or more in hospital on a morphine drip every 3-4 months. don't let anyone touch your spine, as i do believe you will really regret it down the track. the pain will never fully dissipate, but it will ease of in time.07-05-2013, 09:13 AM # 4mizkt90Newbie (male)Join Date: Jul 2013Posts: 3Re: Can a large ruptured disc heal itself? Thanks for the reply. I have gotten a second opinion, and he affirmed that surgery is justified for L2-L3. He did not recommend the fusion, but the original surgeon said that with the extent of the injury, fusion would likely be needed somewhere down the road. He said a second surgery would involve scar tissue and healing is much more difficult in that scenario. He is a personal friend and I do trust him. It was difficult for me to get a second opinion, but he completely understood. He did say that it is customary to wait at least 6 weeks to see how the injury progresses, and did recommend putting off the surgery. But the constant pain and weakness is getting old already. Meds do help, but I'm not getting any better. It is getting to the point where I cannot walk steps anymore. And yes the meningitis comment was aimed at the cortisone injection, and the recent problems with those. My opinion is that there is no reason to inject something in my spine that does nothing to fix the problem. I'd much rather try to control the pain with the meds. My wife and I are in the process of building a new house, and it's depressing not being able to work on things that need to get done. We have a Florida vacation planned for the first part of August, and I'm not sure how long I can ride in a car. I am really second guessing postponing surgery. Surgeon is equally concerned with the degeneration at L5-S1, but he knows that L2-L3 is what is causing the current problems and needs to be addressed first. I have full function of my calf and can tip toe on the left foot without any problems so L5-S1 is not in play right now even though it appears that the bulge is very close to putting pressure on the nerve. He says it would be too much to try to address both issues with one surgery. Anyway, I do appreciate the response and explanation. I don't know what I'm going to do at this point, but I am leaning to scheduling the surgery as soon as I can get back in. Having the second opinion recommend surgery makes that decision a little easier. Again, thanks for the insight.07-05-2013, 05:09 PM # 5twohands Senior Veteran (female)Join Date: Dec 2010Location: USAPosts: 598Re: Can a large ruptured disc heal itself?miztk90, Welcome to the boards, and teteri66 did a great job of explaining your situation. I would add that I was once told by a spine surgeon that given time (lots of time, like 6-12 months), the body can often reabsorb up to 50% of a disc herniation. For some people, this is enough to give pain relief, for others, it's not. We all have varying amounts of space in our spinal canal - some are quite wide, and some quite narrow. This then means that some people can recover quite well from a disc herniation, and others aren't able to. If you have a large annual tear in the side of your disc, the body can rarely recover from this, and in this situation the caustic chemical insides of the disc will leak out on your nerve roots causing severe pain. The only way to tell how bad an annual tear is is to have a discogram (I had one and it wasn't bad at all for me, but others report severe discomfort from the test). Repairing a severe annual tear requires a fusion, but less severe annual tears can often be left alone as they don't go all the way through the disc so none of the interior chemicals of the disc leak out. Whether you have surgery now or wait until later is a decision that is very personal and you're the only one that can make it. Pain is a great motivator to sign up for surgery, but the down side is that surgery won't restore you to what you were before surgery, and you run the risk of even being worse off after surgery. Prior to having back surgery, I was in an unfortunate situation that I couldn't work and was basically forced to have spine surgery far sooner than I would have liked to have it as I wasn't able to perform my job as I was. I've now had 6 spine surgeries and have ended up on SSDI, and I had a lot of surgical complications that normally only affect less than 5% of the population. I have a friend who had 2 herniated discs and was in severe pain, and decided to wait, even though she was in horrible pain on a daily basis. She said after 6-12 months she got much better than she was, but she said it felt like forever to improve. She's back working and said she's really glad she waited as she was able to avoid surgery. HTH, and best wishes!07-06-2013, 12:11 PM # 6teteri66Senior Veteran (female)Join Date: Nov 2010Location: USAPosts: 8,911Re: Can a large ruptured disc heal itself? I would just like to mention that after a lumbar surgery, common instructions include not sitting more than 15-20 minutes at a time. I'm thinking about your planned car trip in the beginning of August... Sitting puts 30+% more pressure on the discs than either standing/walking or lying down. Patients are usually instructed to not ride in cars except for short trips for a number of weeks post surgery (number of weeks depends on the procedure that was done). You'll need to think how the timing of the surgery, and more importantly, the recovery will fit into your plans. Be sure you understand what is involved with recovery. There is no spine surgery that is an easy fix. Before my first surgery, my internist said something that no spine doctor ever mentioned to me...and it is something that always stayed with me. No spine surgery will return you to the way you were prior to onset of pain or injury. For many it is a life-changing experience.07-08-2013, 07:51 PM # 7mizkt90Newbie (male)Join Date: Jul 2013Posts: 3Re: Can a large ruptured disc heal itself? Thanks to all for the insight on your experiences. My surgeon noted my apprehensiveness and insists on waiting at least a month for surgery, which I am in complete agreement. That gets me past the vacation in Florida (I am not looking forward to the drive down), but I hope that the pain and weakness subsides somewhat before then. I have to take two hydrocodone and a muscle relaxant every night to get any sleep. My thigh is at about 20% strength, and at times it is like I am dragging dead weight. I am very conscientious about every step, as I have fallen up steps several times. The pain is bearable but there 24/7. I do realize that my back will never be the same, but I cannot imagine being like this for 6 months or longer. I know there are horror stories (as I've read on this board), but for every one, there are so many more successes. My wife and daughter both have had discectomy surgeries and have had absolutely no problems whatsoever. My wife is going on 23 years with literally no back pain. I know fusion is a different story, and that is why I took the time to get the second opinion. Right now, I'll see how it goes for the next few weeks and make a decision at that time. Hopefully, I'll beat the odds and the disc will shrink enough to get off the nerve. Again, thanks to all for sharing their experiences. It helps to know there are some out there that understand what I'm going through.07-08-2013, 09:19 PM # 8teteri66Senior Veteran (female)Join Date: Nov 2010Location: USAPosts: 8,911Re: Can a large ruptured disc heal itself? Especially since you will be traveling, it is important to be aware of ""cauda equina syndrome."" If you should suddenly develop loss of bladder or bowel control, or suddenly develop weakness such as dropped foot, seek medical attention right away. Do not try to wait until you get home. ( As a matter of fact, it would be a good idea to travel with your MRI just in case!!) It might be nothing, but in the event you have developed cauda equina it is important to get the nerve or nerves decompressed quickly. Otherwise damage can be permanent. Cauda equina syndrome occurs when the nerve roots are compressed and paralyzed, cutting off sensation and movement. Nerve roots that control the function of the bladder and bowel are especially vulnerable to damage. You can also lose sexual function. This can happen if a disc ruptures, there is stenosis, or things like a sudden injury (fall, car crash, etc. ), a tumor, etc. Anyone who has lower lumbar problems needs to be familiar with the symptoms of cauda equina syndrome. It is possible to go into an emergency room and find yourself with a staff that is not familiar with this problem...so if it should happen, be prepared to be persistent and be sure they rule out CES. Don't let them send you home, telling you to keep an eye on things. Don't lose sleep over this. It is a rare happening...but, I wanted you to know about it for your own safety.« post op recovery from acdf - how long should it take? | L1endplate compression Fx »Thread Tools Search this Thread Show Printable Version Email this Page Search this Thread: Advanced Search Posting Rules You may not post new threads You may not post replies You may not post attachments You may not edit your posts BB code is Off Smilies are On [IMG] code is Off HTML code is Off Trackbacks are Off Pingbacks are Off Refbacks are Off Forum Rules "'}
